In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Sex':['M', 'F', 'F', 'D', '?'],
                  'Age':[25, 40, 30, 290, 19],})
df

  Sex  Age
0   M   25
1   F   40
2   F   30
3   D  290
4   ?   19

In [3]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [4]:
    df.replace({'Sex': {'D':'F', '?':'M'},
               'Age':{290 : 20}})

  Sex  Age
0   M   25
1   F   40
2   F   30
3   F   20
4   M   19

In [5]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [6]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [7]:
df

  Sex   Age
0   M  25.0
1   F  40.0
2   F  30.0
3   D  29.0
4   ?  19.0

In [8]:
df.columns

Index(['Sex', 'Age'], dtype='object')

In [9]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],  index=[
    'Julius Markwei',
    'Robert Inkoom',
    'Jason Niils',
    'Jim Moriaty',
    'Peter Peters',
    'Sherlock Holmes',
    'Kloaus Shalotte'
])

In [10]:
ambassadors

Julius Markwei             France
Robert Inkoom      United Kingdom
Jason Niils        United Kingdom
Jim Moriaty                 Italy
Peter Peters              Germany
Sherlock Holmes           Germany
Kloaus Shalotte           Germany
dtype: object

In [11]:
ambassadors.duplicated()

Julius Markwei     False
Robert Inkoom      False
Jason Niils         True
Jim Moriaty        False
Peter Peters       False
Sherlock Holmes     True
Kloaus Shalotte     True
dtype: bool

In [12]:
ambassadors.duplicated(keep='last')

Julius Markwei     False
Robert Inkoom       True
Jason Niils        False
Jim Moriaty        False
Peter Peters        True
Sherlock Holmes     True
Kloaus Shalotte    False
dtype: bool

In [13]:
ambassadors.duplicated(keep=False)

Julius Markwei     False
Robert Inkoom       True
Jason Niils         True
Jim Moriaty        False
Peter Peters        True
Sherlock Holmes     True
Kloaus Shalotte     True
dtype: bool

In [14]:
ambassadors.drop_duplicates()

Julius Markwei            France
Robert Inkoom     United Kingdom
Jim Moriaty                Italy
Peter Peters             Germany
dtype: object

In [15]:
ambassadors.drop_duplicates(keep=False)

Julius Markwei    France
Jim Moriaty        Italy
dtype: object

In [16]:
players = pd.DataFrame({
    'Name' : [
        'Micheal Scotfield',
        'Alexamder Mahone',
        'Micheal Scotfield',
        'Theodore Bagwe',
        'Last Killer'
    ],
    'Pos' : [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})
players

                Name Pos
0  Micheal Scotfield  SG
1   Alexamder Mahone  SF
2  Micheal Scotfield  SG
3     Theodore Bagwe  SF
4        Last Killer  SF

In [17]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [18]:
df2 = pd.DataFrame({
    'Data': [
        '1985_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1979?_M_  IT_1',
        '1985_F_I  T_2'
    ]
})

In [19]:
df2

             Data
0    1985_M_US _1
1    1990?_M_UK_1
2     1992_F_US_2
3  1979?_M_  IT_1
4   1985_F_I  T_2

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [22]:
df2.info

<bound method DataFrame.info of              Data
0    1985_M_US _1
1    1990?_M_UK_1
2     1992_F_US_2
3  1979?_M_  IT_1
4   1985_F_I  T_2>

In [24]:
df2['Data']

0      1985_M_US _1
1      1990?_M_UK_1
2       1992_F_US_2
3    1979?_M_  IT_1
4     1985_F_I  T_2
Name: Data, dtype: object

In [26]:
df2['Data'].str.split('_')

0      [1985, M, US , 1]
1      [1990?, M, UK, 1]
2       [1992, F, US, 2]
3    [1979?, M,   IT, 1]
4     [1985, F, I  T, 2]
Name: Data, dtype: object

In [27]:
df2['Data'].str.split('_', expand=True)

       0  1     2  3
0   1985  M   US   1
1  1990?  M    UK  1
2   1992  F    US  2
3  1979?  M    IT  1
4   1985  F  I  T  2

In [31]:
df2 = df2['Data'].str.split('_', expand=True)

In [32]:
df2.columns = ['Year', 'Sex', 'Country', 'No Children']

In [34]:
df2

    Year Sex Country No Children
0   1985   M     US            1
1  1990?   M      UK           1
2   1992   F      US           2
3  1979?   M      IT           1
4   1985   F    I  T           2

In [38]:
df2['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [39]:
df2['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [40]:
df2['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [41]:
df2['Country'].str.replace(' ', '')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [50]:
df2["Year"].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

0    1985
1    1990
2    1992
3    1979
4    1985
Name: Year, dtype: object